# IsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..IsValid Method
FabricationServiceButton Class See Also
---
Checks if the button contains only valid fittings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the button contains only valid fittings.
# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace